const r = {
    ISTJ: {
        img: "candy.png",
        result: "시원한 페퍼민트 사탕",
        extra: "",
        gift: "차 세트",
        explain:
            "이번 휴일에도 집에서 가족들과 또는 가까운 친구들과 안락한 시간을 보내겠죠?<br>차가워 보이지만 아는 사람은 당신의 달콤함을 알고 있죠.<br>가끔은 규칙을 벗어나도, 원리 원칙적이지 않아도 괜찮아요.<br>연말 인사랍시고 하는 잔소리와 참견은 훌훌 날려버려요.<br>대신, 가족들과 친한 사람에게 나누는 내 인사말도 한번 살펴봅시다.<br>항상 깔끔한 환경을 유지하며 주어진 일을 책임맡아 끝까지 수행하느라 올 한 해 수고했어요.<br>2024년에는 가족과 더 즐거운 시간을 보내며, 계획하는 일이 모두 이루어지길 바랄게요.",
    },

    ISFJ: {
        img: "snowman.png",
        result: "맑은 눈사람",
        extra: "",
        gift: "달력",
        explain:
            "혼자 있는 시간을 즐기는 당신, 이번 연말에 몸과 마음이 따뜻한 시간을 보낼 수 있길 바래요.<br>타인에게 헌신하고 베푸며 보낸 한 해, 수고 많았어요.<br>타인의 신뢰도 많이 얻은 만큼 가끔은 나 자신을 위해 행동해봐요.<br>모두가 알고 당신을 위해줄거에요.<br>2024년 새해에는 멋진 일과 만남이 기다리고 있네요.<br>조금은 마음을 열고, 다가오는 이들을 환영해봐요.<br>맑은 눈사람보다도 순수한 영혼을 가진만큼, 좋은 인연을 앞으로 계속 쌓아갈 수 있을거에요.<br>메리 크리스마스!",
    },

    INTJ: {
        img: "stockings.png",
        result: "선물이 가득 담긴 양말 주머니",
        extra: "",
        gift: "나무 체스보드",
        explain:
            "독립적이고 논리적인 첫인상을 가졌지만, 실제로 들여다보면 작은 선물 가득한 사람이에요.<br>이미 한 해를 돌아보며 2024년 계획도 세워뒀을 것 같네요.<br>내가 믿고 추구하는 바를 더 구체화하는 한 해를 보냈을 것 같아요.<br>그리고 이번 새해에도 당신의 확신과 집념이라면 무엇이든 해낼 수 있을 것 같은데요!<br>새해에는 어떤 계획을 세웠는지 궁금하네요.<br>혁신적인 발상으로 그 어느 것보다도 멋진 결과가 있기를 바랄게요.<br>메리 크리스마스!",
    },

    INFJ: {
        img: "rudolph.png",
        result: "미스테리 루돌프",
        extra: "",
        gift: "책",
        explain:
            "감정적이면서도 동시에 이성적인 당신, 타인을 꿰뜷어보는 루돌프같은 능력도 지녔어요.<br>하는 일에 의미를 찾고 원리를 궁금해 하는 당신은 자기만의 세계를 지금까지 잘 지어왔죠.<br>타인에 의해 휘둘리지 않고 결단력 있는 모습에 반한 주위 친구들도 많을 것 같아요.<br>올 한해, 즐거웠던 일과 힘들었던 일을 되짚어보느라 잠들기 전에 많은 시간을 보냈을 것 같은데,<br>가끔은 미련없이 잊고, 미래만을 그리는 것도 방법이에요.<br>2024년에는 열린마음으로 더욱 성장하는 한 해를 보내는 건 어떨까요?<br>메리 크리스마스!",
    },

    ISTP: {
        img: "candle.png",
        result: "따뜻하고 향기로운 캔들",
        extra: "",
        gift: "폴라로이드",
        explain:
            "생각은 적극적이지만, 행동은 소극적인 당신, 그러나 속에 뚜렷한 주관이 자리를 잡았네요.<br>당신의 놀라운 집중력과 정밀함은 그 누구도 이길 수 없을 것 같은데요?<br>생각한 만큼이나 크고 멋진 결과가 있는 2024년이 되었으면 좋겠어요.<br>그리고 혼자 보내는 시간도 좋지만, 가끔 타인의 따뜻한 불길과 향기를 느낄 수 있는 새해가 되었으면 좋겠어요.<br>메리 크리스마스!",
    },

    ISFP: {
        img: "movie.png",
        result: "크리스마스 영화",
        extra: "",
        gift: "파자마",
        explain:
            "현재에 집중하며 순간순간에 몰두하는 당신, 동시에 다른 사람도 당신에게 몰두하게 만드는 매력이 있죠.<br>마치 매년 재생 목록에 담는 크리스마스 영화같은 매력을 지녔어요.<br>타인의 의견에 개방적이며 수용하기도 하지만, 가끔은 타인을 의심하고, 내 신념을 고집해도 괜찮아요.<br>당신의 성실함과 인내심이라면 그 어떤 것도 해낼 수 있을 것 같군요.<br>새해에도 조화롭고 행복한 일만 가득했으면 좋겠어요.<br>따뜻한 크리스마스 영화는 꼭 해피엔딩을 가지고 있죠.<br>러브 액츄얼리를 틀어놓고 행복한 2023년 마무리 어떨까요?",
    },

    INTP: {
        img: "fireplace.png",
        result: "따뜻한 온기를 주는 벽난로",
        extra: "",
        gift: "목도리",
        explain:
            "엉뚱함과 특이한 유머감각을 지닌 당신, 알게 모르게 주위 사람들은 당신의 따스함에 녹고 있습니다.<br>다른 사람들은 정말 친해지기 전까지 당신을 파악하기 어려워 할거에요.<br>논리적으로 맞다고 생각되면 본인을 향한 비난도 쿨하게 수긍하는 모습 또한 모두가 신기해 할 것 같고요.<br>결과보다 과정이 중요한 당신은 모든 과정을 아는 스스로에게 엄격하고, 타인에게는 오히려 너그러운 모습을 보이네요.<br>가끔은 나 자신에게도 더 너그러워져도 괜찮을 것 같아요.<br>2023년동안 수고했고, 알찬 새해가 되길 바래요.",
    },

    INFP: {
        img: "gift.png",
        result: "포장지 속의 선물",
        extra: "",
        gift: "손편지",
        explain:
            "진실과 진정성을 추구하는 당신, 당신의 이해심과 열린 마음을 아는 이에게는 존재 자체가 그 무엇보다 소중한 선물일 거에요.<br>고정관념이 없이 타인을 바라보는 모습이 참 멋져요.<br>독특한 감수성을 참 재미있다고 생각하는 친구도 많을 것 같은데, 이 모습마저 사랑스러워요.<br>이 세상 모두가 당신같은 시선으로 세계를 바라보면 평화롭고 따뜻한 일만 가득할 것 같아요.<br>이번 새해가 당신에게 주어지는 선물같이 행복한 일만 가득하길 바래요.",
    },

    ESTJ: {
        img: "snowflake.png",
        result: "새하얀 눈송이",
        extra: "",
        gift: "가죽 지갑",
        explain:
            "계획적이고, 계획대로 수행하는 능력을 가진 당신, 2023년동안 목표를 향해 꾸준한 노력을 기울였죠?<br>주어진 임무를 턱턱 완수하는 모습에 주변에서는 놀랐을 거에요.<br>그래도 가끔은 계획을 뒤로하고 즉흥적인 순간을 즐겨보는 것도 좋을 것 같은데,<br>열린 마음을 가지고 새해를 시작하는 건 어떨까요?<br>더 많은 성취와 성공이 당신을 기다리고 있는 2024년, 효율적인 계획과 함께 새로운 도전 해보세요!",
    },

    ESFJ: {
        img: "lease.png",
        result: "화사한 크리스마스 리스",
        extra: "",
        gift: "공연 티켓",
        explain:
            "주변을 챙기며 화사한 에너지를 퍼뜨리는 당신, 연말을 책임지는 따뜻하고 화사한 크리스마스 리스같아요.<br>다양한 컬러와 장식이 더해진 리스가 마치 당신의 재치와 매력을 나타내는 듯해요.<br>주변 사람들이 모여 행복한 순간을 나누는 모습이 당신의 마음을 더욱 풍성하게 만드는 만큼 바쁜 연말을 보내고 있을 것 같아요.<br>올 한해 주위 사람을 챙기며 보람찬 시간을 보내느라 수고했어요.<br>새해에는 따뜻하고 행복한 순간들이 더욱 가득하길 기대해봐도 될 것 같아요!<br>메리 크리스마스!",
    },

    ENTJ: {
        img: "globe.png",
        result: "스노우맨 스노우글로브",
        extra: "",
        gift: "알람 시계",
        explain:
            "논리적이고 결단력 있는 당신, 이번 해에는 목표를 달성하기 위해 많은 노력을 기울였죠. 수고했어요.<br>도전을 두려워하지 않고 리더십을 발휘하는 당신은 많은 존경을 받을 거에요.<br>가끔은 주변의 의견을 들어주고 수용하는 것도 중요하니, 이번 새해를 기회로 삼아 새로운 아이디어를 수용해보는 것은 어떨까요?<br>2024년에는 원하는 더 큰 성과를 이룰 수 있길 바래요!",
    },

    ENFJ: {
        img: "jazz.png",
        result: "배경을 채우는 묵직한 재즈 음악",
        extra: "",
        gift: "꽃",
        explain:
            "타인에 대한 배려와 도움을 아끼지 않는 당신은 묵직하고도 아늑한 재즈 음악 같아요.<br>2023년에는 주변 사람들과의 유대감을 높이며 소중한 순간을 함께 나눴을 것 같아요.<br>연말인 만큼, 나 자신을 위해 힐링하는 시간을 갖는 것도 중요하니, 나를 위한 시간을 보내는 건 어떨까요?<br>관계에 있어 진심을 다하는 만큼 당신을 향해 진실되고 견고한 사람이 주위에 많을 거에요.<br>2024년에는 더 많은 사람들과 소통하며 새로운 경험을 쌓아보아도 풍요로운 새해가 될 것 같아요. 메리 크리스마스 :)",
    },

    ESTP: {
        img: "nutcracker.png",
        result: "백조 사이의 넛크래커",
        extra: "",
        gift: "딸기 타르트",
        explain:
            "장난치는 걸 좋아하는 말썽꾸러기 당신은 백조 사이 개성을 뽐내는 넛크래커 같아요.<br>2023년에는 다양한 활동과 경험을 통해 새로운 자극을 받으며 성장했을 것 같네요.<br>당신만의 관찰력에 모험을 더하면 이 세상에 파헤치지 못할 일을 없을 것 같아요.<br>조금 더 끈기를 가지고 일을 수행하고 마무리 지으면 더욱더 멋진 결과를 일궈낼 수 있을 것 같고요!<br>2024년에도 새로운 경험 가득한 해를 보내길 바래요.<br>어떤 모험이 기다리고 있을지 저도 궁금하네요.<br>메리 크리스마스!",
    },

    ESFP: {
        img: "star.png",
        result: "반짝반짝 트리 위의 별",
        extra: "",
        gift: "장갑",
        explain:
            "밝은 성격과 환한 마음을 가진 당신은 트리 위에서 그 무엇보다 빛나는 별 같아요.<br>정이 많고 사람을 좋아하는 만큼, 다양한 사람의 사랑을 받는 2023년을 보냈을 것 같아요.<br>솔직하게 진심을 털어놓는 모습에 더 가까워진 친구도 많을 것 같네요.<br>그래서인지 이번 연말, 더 바쁜 시간을 보내고 있을 것 같아요.<br>2024년에는 더 많은 흥겨운 순간들이 기다리길 바래요.<br>메리 크리스마스!",
    },

    ENTP: {
        img: "gingerbread.png",
        result: "앙증맞은 진저브레드 쿠키",
        extra: "",
        gift: "목도리",
        explain:
            "창의적이고 독창적인 당신, 2023년 한 해동안 주변을 화사하게 만들었을 거에요.<br>자신감과 뚜렷한 가치관을 가진 당신의 모습에 매료된 사람이 많을 것 같아요.<br>가끔은 계획을 따르며 목표를 달성하는 것도 보람차요!<br>열린 마음으로 이것 저것 새해 계획을 세워봐도 괜찮을 것 같아요.<br>아이디어만큼은 흘러 넘치잖아요!<br>2024년에는 새로운 기술이나 분야에 도전해보면 더 큰 성공을 거둘 수 있을 거에요. 메리 크리스마스!",
    },

    ENFP: {
        img: "sangria.png",
        result: "분위기를 띄우는 샹그리아",
        extra: "",
        gift: "무드등",
        explain:
            "연말에 따뜻하고 달콤하게 추위를 녹이는 샹그리아 같은 매력을 지닌 당신은 모임에서의 분위기 메이커에요.<br>사람을 기쁘게 해주는 능력이 있고, 친구들의 고민도 잘 들어주는 모습에 재밌으면서도 듬직한 친구가 되었네요.<br>인생을 즐겁게 살려고 노력하는 만큼 이번 새해에 새로운 서프라이즈가 가득할 거에요.<br>열린 마음과 기대를 가지고 2024년을 시작해봐도 될 것 같아요.<br>메리 크리스마스!",
    },
};

const passedResult = sessionStorage.getItem('mbtiResult');
const mbti = r[passedResult]
const deploylink = "https://christmastest.netlify.app"

let result;
let resultImg;
let explain;
let gift;
let shareButton = document.getElementById("share");

function copyURI(evt) {
    evt.preventDefault();
    navigator.clipboard.writeText(deploylink).then(
        () => {
            /*clipboard successfully set */
            alert("링크가 클립보드에 복사되었습니다.")
        },
        () => {
            /*clipboard set failed */
        }
    );
}

document.addEventListener("DOMContentLoaded", function () {

    shareButton.addEventListener("click", copyURI);
    result = document.getElementById("result");
    resultImg = document.getElementById("result-image");
    explain = document.getElementById("explain");
    gift = document.getElementById("gift");

    document.body.style.backgroundColor = "#185033";


    console.log(passedResult);
    console.log(mbti);

    result.textContent = mbti.result;
    resultImg.src = "./img/" + mbti.img;

    exp = mbti.explain.split("<br>");
    console.log(exp);

    for (let i = 0; i < exp.length; i++) {
        const newParagraph = document.createElement("p");

        newParagraph.textContent = exp[i];

        explain.appendChild(newParagraph);
    }

    // explain.textContent = mbti.explain.split("<br>") ;
    gift.textContent = "이번 크리스마스, " + mbti.gift + " 선물도 좋아요 :)";

});